 -- 外部キー制約のためのマスタデータ登録
 -- チェーンマスタ
 INSERT INTO chains (chain_id, name, created_at, updated_at) VALUES
 (1, 'テストチェーン1', '2000-01-01 00:00:00', '2000-01-01 00:00:00');
 -- ショップマスタ
 INSERT INTO shops (shop_id, chain_id, name, created_at, updated_at) VALUES
 (1, 1, 'テストショップ1', '2000-01-01 00:00:00', '2000-01-01 00:00:00');

 -- 商品マスタ
 INSERT INTO items (item_id, chain_id, shop_id, name, price, description, created_at, updated_at) VALUES
 (1, 1, 1, 'テスト商品1', 100, 'テスト商品1説明。', '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
 (2, 1, 1, 'テスト商品2', 200, 'テスト商品2説明。', '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
 (3, 1, 1, 'テスト商品3', 300, 'テスト商品3説明。', '2000-01-01 00:00:00', '2000-01-01 00:00:00');

-- 属性マスタ
   INSERT INTO attributes (name, value, created_at, updated_at) VALUES
   ('サイズ', 'S', '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
   ('販売単位', '1ダース(12本入り)', '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
   ('芯強度', 'HB', '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
   ('商品タイプ', '先削りなし(削り器必要)', '2000-01-01 00:00:00', '2000-01-01 00:00:00');

-- 商品属性関連マスタ
  INSERT INTO item_attributes (item_id, attribute_id, created_at, updated_at) VALUES
  (1, 1, '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
  (2, 2, '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
  (2, 3, '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
  (3, 2, '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
  (3, 3, '2000-01-01 00:00:00', '2000-01-01 00:00:00'),
  (3, 4, '2000-01-01 00:00:00', '2000-01-01 00:00:00');